cases/UNIGUE/70LLTU/K1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0063;

boundaryField
{
    BA  
    {
        type            timeVaryingMappedFixedValue;
        offset          0;
        setAverage      off;
        //mapMethod       nearest;
    }

    CB  
    {
        type            timeVaryingMappedFixedValue;
        offset          0;
        setAverage      off;
    }

    DC  
    {
        type            zeroGradient;
    }

    AD
    {
        type            fixedValue;
        value           uniform 1e-10;
    }

    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
