cases/UNIGUE/70LLTU/K1/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication checkMesh
runApplication $(getApplication)


#------------------------------------------------------------------------------
